Revit 2026 API

# ColumnAttachmentRemoveColumnAttachment(FamilyInstance, ElementId) Method

---

Removes any attachment of the column to the specified target.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RemoveColumnAttachment(
	FamilyInstance column,
	ElementId targetId
)
```
```vb
Public Shared Sub RemoveColumnAttachment (
	column As FamilyInstance,
	targetId As ElementId
)
```
```cpp
public:
static void RemoveColumnAttachment(
	FamilyInstance^ column,
	ElementId^ targetId
)
```
```fsharp
static member RemoveColumnAttachment :
        column : FamilyInstance *
        targetId : ElementId -> unit
```

#### Parameters

column FamilyInstance
     A column.
targetId ElementId
     Id of a target element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method modifies both column and target elements.

#### Reference

ColumnAttachment Class

RemoveColumnAttachment Overload

Autodesk.Revit.DB Namespace